tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        rho
        {
            semiImplicit    false;
        }
        U
        {
            semiImplicit    false;
        }
        Yi
        {
            semiImplicit    false;
        }
        hs
        {
            semiImplicit    false;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Analytical;
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    youngsModulus   0;
    poissonsRatio   0;

    epsilon0        1;
    f0              0.5;
    Pr              0.7;
    Tvap            273;
    Tbp             373;

    constantVolume  false;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
    paramagnetic    off;
}

subModels
{
    InjectionModel  ConeInjectionMP;

    DragModel       SphereDrag;

    DispersionModel none;

    CollisionModel  none;

    PatchInteractionModel StandardWallInteraction;

    HeatTransferModel none;

    CompositionModel SinglePhaseMixture;

    PhaseChangeModel none;

    PostProcessingModel none;

    SurfaceFilmModel ThermoSurfaceFilm; // none;

    radiation       off;

    ConeInjectionMPCoeffs
    {
        SOI             0.000;
        duration        20.000;
        positionsFile   "reactingCloud1Positions";
        axesFile        "reactingCloud1Axes";
        massTotal       10;
        parcelsPerInjector 20000;
        parcelsPerSecond 500;
        parcelBasisType mass;
        flowRateProfile constant 0.1;
        Umag            constant 3.0;
        thetaInner      constant 0;
        thetaOuter      constant 45;

        parcelPDF
        {
            pdfType         RosinRammler;
            RosinRammlerPDF
            {
                minValue        5e-04;
                maxValue        0.0012;
                d               7.5e-05;
                n               0.5;
            }
        }

    }


    StandardWallInteractionCoeffs
    {
        type            rebound;
    }

    SinglePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O 1;
            }
        );
    }

    ThermoSurfaceFilmCoeffs
    {}
}


// ************************************************************************* //
