tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/0.org/wallFilmRegion/pSpf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region0_to_"(region0_to.*)"Region_masterRegion";
    object      pSpf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // Pa

internalField   uniform  0.0;

boundaryField
{
    // cyclic boundaries between film patches
    "(cube[0-9][0-9]_side[0-9]_to_cube[0-9][0-9]_side[0-9])"
    {
        type            nonuniformTransformCyclic;
    }

    // top film surface
    "(.*top)"
    {
        type            zeroGradient;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
        type            directMappedFixedPushedInternalValue;
        average         0.0;
        setAverage      no;
        value           uniform 0.0;
    }

    // floor sides
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
