tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/Allrun
#!/bin/sh

cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre
runApplication reactingParcelFilmFoam
